-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 30, 2020 at 06:27 AM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `db_book`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_books`
--

CREATE TABLE `tb_books` (
  `b_id` int(10) NOT NULL,
  `b_name` varchar(50) COLLATE utf8_bin NOT NULL,
  `b_cat` varchar(50) COLLATE utf8_bin NOT NULL,
  `b_detail` text COLLATE utf8_bin NOT NULL,
  `b_by` varchar(50) COLLATE utf8_bin NOT NULL,
  `b_img` varchar(2000) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `tb_books`
--

INSERT INTO `tb_books` (`b_id`, `b_name`, `b_cat`, `b_detail`, `b_by`, `b_img`) VALUES
(9, 'คนแอบรัก', 'นิยายรัก', 'มีเพื่อนต่างเพศอยู่คู่หนึ่ง เป็นเพื่อนที่รักกันมาก\n\nที่โรงเรียน\n\nฝ่ายชายจะเดินไปส่งฝ่ายหญิงที่บ้านเสมอทุกวัน\n\nเวลาผ่านไป จนทั้งสองอยู่ มหาวิทยาลัย\n\nฝ่ายหญิงเริ่มไปแอบชอบผู้ชายคนนึง และถามฝ่ายชายว่า\n\n\"นี่ เธอว่า เค้าเหมาะกับเราไหม\"\n\n\"เค้าก้อหล่อดีนะ นิสัยดีด้วย \"\n\n\"หรอ อืม อยากให้เค้ามาอยู่ข้างๆเราจังเลยเนอะ\"\n\nต่อมาหญิงสาวก็ได้เป็นแฟนกับผู้ชายคนนั้นจิงๆ\n\nวันนึงหญิงสาวบอกกับเพื่อนสนิทของตนว่า\n\n\"นี่ เธอไม่ต้องมาส่งเราทุกวันแล้วแหละ ตอนนี้เค้าจะมาส่งเราแล้ว เราไม่อยากให้เค้าเข้าใจผิด\"\n\n\"อืม\" ฝ่ายชายตอบรับ และไม่ไปส่งหญิงสาวอีก\n\nต่อมาหญิงสาวทะเลาะกับแฟนของตน\n\nจึงมาปรึกษาเพื่อนชายว่า\n\n\"เธอ เด๋วนี้เขาไม่ค่อยสนใจเราเลยแหละ เธอว่า เราจะทำอย่างไรดีหล่ะ\"\n\n “เธอยังรักเค้าอยู่หรือป่าวหล่ะ\"\n\nฝ่ายชายตอบ\n\n\"รักสิ รักมากด้วย\"\n\n\"ถ้าอย่างนั้น ก็มอบความรักให้เขาต่อไปสิ ก้อเธอรักเค้านี่น่า\"\n\n\"อืมม\"\n\nหญิงสาวทำตามคำแนะนำของฝ่ายชาย\n\nหลังจากนั้น\n\nวันหนึ่ง\n\nระหว่างที่เพื่อนชายหนุ่มเดินกลับบ้าน เค้าเห็นหญิงสาวนั่งร้องไห้อยู่ข้างทาง\n\n\"เธอ เป็นอะไรหน่ะ ให้เราช่วยไหม\"\n\n\"เค้าไม่รักเราเลยหล่ะ เขาเปลี่ยนไป เด๋วนี้เขาไม่เคยมาส่งเราที่บ้านเลย\"\n\n\"แล้วเราจะช่วยอะไรเธอได้บ้างหล่ะ\"\n\nช่วยอยู่กับเราซักพักได้ไหม\"หญิงสาวร้องขอ\n\nทั้งสองนั่งอยู่ด้วยกันโดยไม่พูดอะไรเลย\n\nในที่สุดหญิงสาวก็เอ่ยขึ้น\n\n\"เราควรจะทำอย่างไรดี เธอจะช่วยเราได้ไหม ว่าเราควรจะทำอย่างไรดี\"\n\n\"เธอยังรักเขาอยู่หรือป่าวหล่ะ\"\n\n\"รักสิ เรารักเค้ามากเลย\"\n\n\"ถ้าอย่างนั้นก้อรักเค้าต่อไปสิ\"\n\n\"แต่เค้าไม่รักเราเลยนี่น่า\"\n\nหญิงสาวร้องไห้โฮ\n\n\"แต่เธอก็รักเขาไม่ใช่หรอ\"\n\nและชายหนุ่มก็ส่งหญิงสาวที่บ้านอย่างที่เคยทำมาแต่ก่อน\n\n\"ถ้าเมื่อไหร่ที่เธออยากให้เรามาส่งเธอที่บ้าน อย่าลืมเรียกเรานะ\"\n\n\"อืม\"\n\nและหญิงสาวก็เดินขึ้นบ้านไป\n\nต่อมาวันหนึ่งชายหนุ่มได้รับโทรศัพท์จากหญิงสาว\n\n\"เราไม่ไหวแล้ว ช่วยมารับเราที\"\n\nเสียงของหญิงสาวดูช่างอ่อนล้า และหมดกำลัง\n\nเธอกำลังร้องไห้อย่างฟูมฟายอยู่\n\nชายหนุ่มไปหาเธอและไปรับเธอมาส่งบ้าน\n\nเธอยังคงถามชายหนุ่มนั้นเมื่อที่เคยถามมา\n\n\"เราจะทำอย่างไรต่อไปดี\"\n\n\"เธอเลิกรักเค้าแล้วหรอ\"\n\n\"ป่าว เรายังรักเค้ามาก เรายังรักเขาอยู่\"\n\n\"งั้นก็เหมือนที่เราเคยพูดไว้ รักเขาต่อไป เพราะมันไม่สำคัญหรอกว่าเขาจะรักเธอไหม แต่ถ้าเธอยังรักเขา เธอก็คงทำได้แค่รักเขาให้มากขึ้น ให้เขารู้ว่าเธอรักเขา\"\n\nวันที่เธอเรียนจบ\n\nเพื่อนชายหนุ่มของเธอมาแสดงความยินดีกับเธอ\n\nเธอแปลกใจมากที่เพื่อนชายหนุ่มของเธอยังเรียนไม่จบ\n\nเธอถามเขาว่าทำไม\n\nชายหนุ่มตอบว่า\n\nเขาขี้เกียจไปหน่อย ทำให้เขาต้องเรียนซ้ำวิชาหนึ่งจึงยังเรียนไม่จบ\n\nหญิงสาวแปลกใจ\n\nเพราะตลอดมา ชายหนุ่มคนนี้เป็นคนขยัน\n\nต่อมาแฟนหญิงสาวได้แต่งงานกับหญิงสาว\n\nเนื่องด้วยเห็นถึงความรักที่หญิงสาวมีให้มากมาย\n\nหญิงสาวได้ชวนเพื่อนของตนมางานแต่งของเธอ\n\n\"เราไม่ว่างจริงๆ เราติดธุระหน่ะขอโทษนะ\"เพื่อนชายตอบเธอด้วยน้ำเสียงแผ่วเบา”\n\nหญิงสาวโกรธและเสียใจที่ชายหนุ่มไม่มางานแต่งจึงวางหูใส่\n\nแต่หญิงสาวก็ต้องประหลาดใจเมื่อวันที่เธอแต่งงาน\n\nชายหนุ่มได้มาก่อนที่งานแต่งจะจบ\n\n\"ยินดีด้วยนะ เรามาแล้วนะ\"\n\nหญิงสาวดีใจมากที่เพื่อนของเธอมา ถึงจะเพียงชั่วเวลาสั้นๆ\n\nต่อมาหญิงสาวก็มีความสุขกับชีวิตแต่งงานจนไม่ได้ติดต่อกับชายหนุ่ม\n\nจนวันหนึ่งหญิงสาวได้ทะเลาะกับสามีของตน\n\nหญิงสาวไม่รู้จะไปปรึกษาใคร จึงนึกถึงชายหนุ่มขึ้นมา\n\nแต่แม้ว่าหญิงสาวจะโทรไปเท่าไหร่ ก็ไม่สามารถติดต่อกับชายหนุ่มคนนั้นได้เลย\n\nเขาจึงโทรหาเพื่อนของชายหนุ่มคนนั้น\n\nเพื่อนของชายหนุ่มเล่าว่า\n\nชายหนุ่มเป็นโรคร้าย เขาไม่สามารถไปไหนได้ ตอนนี้รักษาตัวอยู่ที่โรงพยาบาลมาร่วมหลายเดือน\n\nหญิงสาวตกใจมากถามว่าเป็นอะไร\n\nเพื่อนชายหนุ่มบอกว่า\n\nอาการกำเริ่มเพราะวันที่ชายหนุ่มต้องมาผ่าตัด ชายหนุ่มดันหายตัวไป และเพื่อนชายยังบอกอีกว่า\n\n\"เป็นนิสัยเสียของมันหน่ะ มันชอบหายตัวไปไหนก็ไม่รู้ในช่วงเวลาสำคัญๆ คราวที่แล้วสอบไล่ ก็หายตัวไปจากห้องสอบ\"\n\nหญิงสาวตกใจมาก เลยขอที่อยู่ของโรงพยาบาลที่ชายหนุ่มรักษาตัว\n\nหญิงสาวไปเยี่ยมชายหนุ่มที่โรงพยาบาล\n\nเมื่อเปิดประตูเข้าไป ก็ต้องตกใจ ชายหนุ่มที่เคยดูแข็งแรง กับผอมซูบ ไม่มีแรง\n\nเมื่อชายหนุ่มเห็นเธอก็ดีใจทักทายเธอเป็นการใหญ่\n\n\"เป็นอย่างไรมั้ง ไม่เจอกันตั้งนาน\"\n\nหญิงสาวนิ่งเงียบซักพักน้ำตาหญิงสาวก็ออกมา\n\n\"อ้าวร้องไห้ทำไมหล่ะ เธอหน่ะ ไปทะเลาะกับแฟนมาอีกแล้วหรอ จะให้เราช่วยอะไรไหม แต่เราก็คงจะแนะนำเหมือนเดิมหน่ะ\"\n\nหญิงสาวเข้าไปหาชายหนุ่มแล้วบอกกับชายหนุ่มว่า\n\n\"วันที่เธอมารับเราเป็นวันสอบไล่ใช่ไหม\"\n\nชายหนุ่มทำหน้าตกใจและไม่กล้าพูดอะไรทั้งสิ้นกลับนิ่งเงียบไป\n\nหญิงสาวจึงพูดต่อ\n\n\"และวันที่เธอต้องผ่าตัดใหญ่เธอกลับมางานแต่งงานของฉันใช่ไหม”\n\nชายหนุ่มไม่รู้จะพูดอะไรอีกแล้ว กลับนิ่งเงียบกว่าเดิม\n\nหญิงสาวเข้าไปกอดชายหนุ่มแล้วพูดด้วยน้ำเสียงสั่น\n\n\"ตลอดเวลา เรารักแต่คนอื่น มองแต่คนอื่น เรากลับไม่รู้เลยว่าเธอรักเรามากแค่ไหน เรารู้สึกเสียใจจริงๆที่ไม่ได้รักเธอมากกว่านี้\"\n\nชายหนุ่มยิ้มขึ้นแล้วบอกกับหญิงสาวด้วยเสียงอันแผ่วเบาว่า\n\n\"เราบอกแล้วไง ถ้าเรารักใครซักคน เราก็ต้องรักเขาให้มากๆไม่สำคัญหรอกว่าเขาจะรักเราหรือไม่หน่ะ มันสำคัญแค่เพียงว่าเรายังรักเธออยู่หรือเปล่า แค่เราสามารถช่วยเธอได้นั่นก็เป็นความสุขของเราแล้ว\"\n\nหญิงสาวรู้สึกเสียใจมาก นั่งร้องไห้โห่อยู่ที่ตักของชายหนุ่ม\n\nชายหนุ่มจึงพูดขึ้นว่า \"ถ้าเราหายเมื่อไหร่ เราจะไปส่งเธอที่บ้านอีกนะ\"\n\n\"อื้อ\" เธอพูดด้วยน้ำเสียงเล็กๆ', 'ฮันสึเนะมิกุฟิล์มจ้า', '/web3.jpg'),
(15, 'ย', 'ฆาตกรรม', 'ฟหกฟหดฟฟกด', 'กฟฟหกฟหก', '/5b20c01146CYquba.jpg'),
(16, '55555555', '18+', 'ไำพำไะพำ', 'ฟหๆๆไำ', '/ddd.jpg'),
(19, 'หนังโป๊', '20+', 'เย็ด', 'ปาย', '/5b20c01146CYquba.jpg'),
(21, '55555555', '5555555555555', '55555555555', '5555555555', '/ddd.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `tb_comment`
--

CREATE TABLE `tb_comment` (
  `c_id` int(10) NOT NULL,
  `c_name` varchar(100) COLLATE utf8_bin NOT NULL,
  `c_detail` varchar(500) COLLATE utf8_bin NOT NULL,
  `c_date` datetime NOT NULL,
  `c_book` int(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `tb_comment`
--

INSERT INTO `tb_comment` (`c_id`, `c_name`, `c_detail`, `c_date`, `c_book`) VALUES
(1, 'adasdad', 'adadasd', '0000-00-00 00:00:00', 2),
(2, 'first', 'สนุกจังเลยครับ', '0000-00-00 00:00:00', 8),
(3, 'ปาย', 'ประยุทหัวควย', '0000-00-00 00:00:00', 21),
(4, 'ปาย', 'ประยุทหน้าหี', '0000-00-00 00:00:00', 21),
(5, 'ฟหกฟหกฟหก', 'ฟหกฟหกฟก', '0000-00-00 00:00:00', 21),
(6, 'lxkp', 'ประยุทหัวดออออออออออออออ', '0000-00-00 00:00:00', 21),
(7, 'หกดกหดกหด', 'กหดดกหดกหดกหดกหดกหด', '0000-00-00 00:00:00', 21),
(8, '010', '555', '0000-00-00 00:00:00', 21),
(9, 'ssad', 'asdasd', '0000-00-00 00:00:00', 21),
(10, 'asdasd', 'asd', '0000-00-00 00:00:00', 21);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_books`
--
ALTER TABLE `tb_books`
  ADD PRIMARY KEY (`b_id`);

--
-- Indexes for table `tb_comment`
--
ALTER TABLE `tb_comment`
  ADD PRIMARY KEY (`c_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_books`
--
ALTER TABLE `tb_books`
  MODIFY `b_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `tb_comment`
--
ALTER TABLE `tb_comment`
  MODIFY `c_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
